package com.yedam.java.example1;

public class Question {
	/*
	 Customer 클래스
	 	- 고객 아이디, 이름, 고객등급
	 	- 보너스포인트, 보너스포인트 적립율
	  	- 등급 : SILVER(최초등급)
	  	- 보너스 포인트 적립율 : 1%
	  	
	  	GOLD 클래스
	  	- 고객 아이디, 이름, 등급
	  	- 보너스 포인트, 보너스 포인트 적립율, 할인율
	  	- 등급 : GOLD
	  	- 보너스 포인트 적립율 : 2%
	  	- 물건을 살 때 할인율 : 10%
	 */
/* 
 * 
 * 보유한 금액이 얼마인가
 * 멤버쉽이 있다는데 가입 가능한 멤버쉽이 있는지
 */
	

	
	/*
	 * 고객센터, 전화상담, 상담원
	 * 일단 고객센터에 전화가 오면 대기열에 저장 
	 * 상담원이 지정되기 전까지 대기상태로
	 * 각 전화를 상담원에 배분
	 * 1) 순서대로 배분 
	 * 2) 짧은 대기열 위주
	 * 3) 우선순위에 따라 배분
	 */
	
}
